app/views/messages/index.html.haml


-@room.messages.each do |m| #Index.html.haml
    .test
---
SELECT "messages".* FROM "messages" WHERE "messages"."room_id" = ?  [["room_id", 1]]

            %strong
                =link_to User.find(m.user_id).username, user_path(m.user)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]