app/views/mapbox/show.html.haml

SELECT "rooms".* FROM "rooms"
---
    var url = protocol+'//'+hostname+':'+port+'/dashboard.json'
    $(document).ready(async function(){
      $('#geocoder').empty();
      $('#geolocate').empty();
      $('#map').empty();
      render_map(buildObjectForMap(url), 0);

      var binded = false;
      function add_handler(){
        if($('.rooms').length > 0){
          var handelerin = function(){
            $('.rooms').removeClass('no_focus');
            $('.rooms').addClass('rooms_not_hover');
            $(this).addClass('rooms_hover');
          };

          var handlerout = function(){
            $('.rooms').removeClass('rooms_not_hover');
            $(this).removeClass('rooms_hover');
            $('.rooms').addClass('no_focus');
          };
