app/views/reservations/create.js.erb


<% if current_user.reservations.exists?(room_id: @room)%>
---
SELECT  1 AS one FROM "reservations" WHERE "reservations"."user_id" = ? AND "reservations"."room_id" = ? LIMIT ?  [["user_id", 2], ["room_id", 1], ["LIMIT", 1]]