app/views/reservations/index.html.haml

-if @room.fifo
  -@room.reservations.each do |r|
---
SELECT "reservations".* FROM "reservations" WHERE "reservations"."room_id" = ? ORDER BY position  [["room_id", 1]]

        .col-2.my-auto.text-center
          -if !current_user || !current_user.powers.exists?(room_id: @room.id)
            -if r.user != current_user && current_user.reservations.exists?(room_id: @room.id)
---
SELECT  1 AS one FROM "powers" WHERE "powers"."user_id" = ? AND "powers"."room_id" = ? LIMIT ?  [["user_id", 2], ["room_id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]