app/helpers/rooms_helper.rb

SELECT  1 AS one FROM "powers" WHERE "powers"."user_id" = ? AND "powers"."room_id" = ? LIMIT ?  [["user_id", 3], ["room_id", 1], ["LIMIT", 1]]
---
  def do_i_matter?
    @room = Room.find(params[:id])
    current_user && (current_user.admin? || current_user.powers.exists?(room_id: @room.id))

SELECT  1 AS one FROM "reservations" WHERE "reservations"."user_id" = ? AND "reservations"."room_id" = ? LIMIT ?  [["user_id", 2], ["room_id", 1], ["LIMIT", 1]]
---
  def can_i_reserve?
    @room = Room.find(params[:id])
    !current_user || (!do_i_have_powers? && !current_user.reservations.exists?(room_id: @room.id))

SELECT  1 AS one FROM "powers" WHERE "powers"."user_id" = ? AND "powers"."room_id" = ? LIMIT ?  [["user_id", 3], ["room_id", 1], ["LIMIT", 1]]
---
  def do_i_have_powers?
    @room = Room.find(params[:id])
    current_user && current_user.powers.exists?(room_id: @room.id)