app/views/rooms/_remind.html.haml

-if current_user.reservations.exists?(room_id: @room.id)
  =form_for(current_user.reservations.find_by(room_id: @room.id), html: { method: :patch}, remote: true) do |f|
---
SELECT  "reservations".* FROM "reservations" WHERE "reservations"."user_id" = ? AND "reservations"."room_id" = ? ORDER BY position LIMIT ?  [["user_id", 2], ["room_id", 1], ["LIMIT", 1]]
SELECT  1 AS one FROM "reservations" WHERE "reservations"."user_id" = ? AND "reservations"."room_id" = ? LIMIT ?  [["user_id", 2], ["room_id", 1], ["LIMIT", 1]]