app/views/rooms/_unjoin.html.haml

= form_for([@room, current_user.reservations.find_by(room_id: @room.id)], html: { method: :delete}, remote: true) do |f|
  .form-group
---
SELECT  "reservations".* FROM "reservations" WHERE "reservations"."user_id" = ? AND "reservations"."room_id" = ? ORDER BY position LIMIT ?  [["user_id", 2], ["room_id", 1], ["LIMIT", 1]]