app/views/rooms/show.html.haml

SELECT "powers".* FROM "powers" WHERE "powers"."room_id" = ?  [["room_id", 1]]
---
          %tbody
          -@room.powers.each do |p|

SELECT  1 AS one FROM "reservations" WHERE "reservations"."user_id" = ? AND "reservations"."room_id" = ? LIMIT ?  [["user_id", 3], ["room_id", 1], ["LIMIT", 1]]
---
      .col.text-center#reminderdiv{:style => 'margin-top: 10px;'}
        -if !current_user.nil? && current_user.reservations.exists?(room_id: @room.id)

SELECT "messages".* FROM "messages" WHERE "messages"."room_id" = ?  [["room_id", 1]]
---
      .div{:style=>"overflow-y:scroll; height: 100%;padding-bottom:10px;",:id=>"messages_div"}
        -@room.messages.each do |m|

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---

              =link_to User.find(m.user_id).username, user_path(m.user)