app/controllers/conversations_controller.rb

  def new
  	@recipients = User.all - [current_user]
---
SELECT "users".* FROM "users"

  def create
  	recipient = User.find(params[:user_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]