app/controllers/mapbox_controller.rb

SELECT "rooms".* FROM "rooms"
---
	def show
    @room = Room.all

    @roomlist = []

    @room.each do |r|