app/controllers/messages_controller.rb

	def create
		@message = @room.messages.build(message_params)
		@message.user = current_user
		if !@message.save
---
INSERT INTO "messages" ("room_id", "user_id", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)

	def pin
		oldone = Message.find_by(pinned: true)
		oldone.change_pin if oldone
		newone = Message.find(params[:message_id])
---
SELECT  "messages".* FROM "messages" WHERE "messages"."pinned" = ? LIMIT ?  [["pinned", 1], ["LIMIT", 1]]
SELECT  "messages".* FROM "messages" WHERE "messages"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

	def edit
		@to_edit=Message.find(params[:id])
		@room=Room.find_by(id: @to_edit.room_id)
---
SELECT  "messages".* FROM "messages" WHERE "messages"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
SELECT  "rooms".* FROM "rooms" WHERE "rooms"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

	def update
		@to_edit=Message.find(params[:id])
		@to_edit.body=params[:message][:body]
		@to_edit.save!
---
SELECT  "messages".* FROM "messages" WHERE "messages"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
UPDATE "messages" SET "body" = ? WHERE "messages"."id" = ?  [["body", "ll"], ["id", 7]]

		def set_room
			@room = Room.friendly.find(params[:room_id])
---
SELECT  "rooms".* FROM "rooms" WHERE "rooms"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]