app/controllers/messages_controller.rb

    def pin
      oldone = messages.find_by(pinned: true).pinned = false
      oldone.save
---
UPDATE "messages" SET "pinned" = ? WHERE "messages"."id" = ?  [["pinned", 1], ["id", 1]]