app/controllers/reservations_controller.rb

SELECT  "reservations".* FROM "reservations" WHERE "reservations"."user_id" = ? AND "reservations"."room_id" = ? ORDER BY position LIMIT ?  [["user_id", 2], ["room_id", 1], ["LIMIT", 1]]
INSERT INTO "reservations" ("user_id", "room_id", "position", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 2], ["room_id", 1], ["position", 1], ["created_at", "2018-09-17 00:25:55.216463"], ["updated_at", "2018-09-17 00:25:55.216463"]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT  1 AS one FROM "reservations" WHERE "reservations"."user_id" = ? AND "reservations"."room_id" = ? LIMIT ?  [["user_id", 2], ["room_id", 1], ["LIMIT", 1]]
SELECT  1 AS one FROM "powers" WHERE "powers"."room_id" = ? AND "powers"."user_id" = ? LIMIT ?  [["room_id", 1], ["user_id", 2], ["LIMIT", 1]]
SELECT COUNT(*) FROM "reservations" WHERE "reservations"."room_id" = ? AND "reservations"."position" = ?  [["room_id", 1], ["position", 1]]
---
  def create
    @reservation = @room.reservations.new(:user_id => params[:user_id], :position => params[:position])
    if(checkValidation)
      if !User.find(params[:user_id]).reservations.exists?(room_id: @room.id) && @reservation.save!
        flash.now[:success] = 'Prenotazione effettuata'
      else
        flash.now[:warning] = 'Errore! Qualcosa è andato storto'
      end

    else
      if(@room.powers.exists?(user_id: @reservation.user_id))
        flash.now[:danger] = 'Errore! Sei un room host!'
      elsif(@room.reservations.count > @room.max_participants)

UPDATE "reservations" SET "reminder" = ?, "updated_at" = ? WHERE "reservations"."id" = ?  [["reminder", 1], ["updated_at", "2018-09-17 00:25:58.993824"], ["id", 1]]
---
  def update

    if params[:reminder]
      flash.now[:success] = 'Reminder aggiornato!'
      @reservation.update(reminder: params[:reminder])

SELECT  "reservations".* FROM "reservations" WHERE "reservations"."id" = ? ORDER BY position LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def correct_user
      @reservation = Reservation.find(params[:id])

SELECT  1 AS one FROM "powers" WHERE "powers"."room_id" = ? AND "powers"."user_id" = ? LIMIT ?  [["room_id", 1], ["user_id", 2], ["LIMIT", 1]]
SELECT COUNT(*) FROM "reservations" WHERE "reservations"."room_id" = ?  [["room_id", 1]]
---
    def checkValidation
      !@room.powers.exists?(user_id: @reservation.user_id) && @room.reservations.count < @room.max_participants && DateTime.current < @room.max_unjoin_time

SELECT  "rooms".* FROM "rooms" WHERE "rooms"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_room
      @room = Room.friendly.find(params[:room_id])