app/controllers/reservations_controller.rb

  def update
    @reservation = Reservation.find(params[:id])
---
SELECT  "reservations".* FROM "reservations" WHERE "reservations"."id" = ? ORDER BY position LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def destroy
    @room = Reservation.find(params[:id]).room
---
SELECT  "rooms".* FROM "rooms" WHERE "rooms"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]