app/controllers/rooms_controller.rb

  def create
    @room = current_user.rooms.build(room_params)
    #AL MOMENTO SENZA LA DEFINIZIONE DELLA SESSIONE, E' MEGLIO COMMENTARLO

    respond_to do |format|
      if @room.save
        Power.create(room_id: @room.id, user_id: current_user.id)
---
INSERT INTO "rooms" ("name", "description", "fifo", "max_participants", "address", "latitude", "longitude", "private", "time_from", "time_to", "recurrence", "user_id", "created_at", "updated_at", "hash_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
INSERT INTO "powers" ("user_id", "room_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 3], ["room_id", 1], ["created_at", "2018-09-17 00:16:44.148436"], ["updated_at", "2018-09-17 00:16:44.148436"]]

    def set_room
      @room = Room.find(params[:id])
---
SELECT  "rooms".* FROM "rooms" WHERE "rooms"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]