app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "kikurasa93@gmail.com"], ["LIMIT", 1]]
INSERT INTO "users" ("username", "email", "created_at", "updated_at", "activation_digest", "activated") VALUES (?, ?, ?, ?, ?, ?)
UPDATE "users" SET "updated_at" = ?, "activated_at" = ? WHERE "users"."id" = ?  [["updated_at", "2018-09-16 23:53:45.901989"], ["activated_at", "2018-09-16 23:53:45.901012"], ["id", 3]]
SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "danieligno@gmail.com"], ["LIMIT", 1]]
---
  def create
    auth_hash = request.env['omniauth.auth']
    if auth_hash
      user = User.find_by(email: auth_hash['info']['email'].downcase)
      if user

        log_in user
        redirect_back_or user
      else
        user = User.new :username => auth_hash["info"]["name"], :email => auth_hash["info"]["email"]
        user.activate

        if user.save

          log_in user
          redirect_back_or user
        end
      end



    else

    user = User.find_by(email: params[:session][:email].downcase)