app/controllers/sessions_omniauth_controller.rb

SELECT  "user_omniauths".* FROM "user_omniauths" WHERE "user_omniauths"."email" = ? LIMIT ?  [["email", "kikurasa93@gmail.com"], ["LIMIT", 1]]
INSERT INTO "user_omniauths" ("name", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Mihai Zapodeanu"], ["email", "kikurasa93@gmail.com"], ["created_at", "2018-09-16 21:21:35.845431"], ["updated_at", "2018-09-16 21:21:35.845431"]]
---
  def create
    auth_hash = request.env['omniauth.auth']


  if UserOmniauth.find_by_email(auth_hash['info']['email'])

    user_aux=UserOmniauth.find_by_email(auth_hash['info']['email'])

    session[:user_id]=user_aux.uid
    flash[:success]="Ben tornato #{auth_hash['info']['name']} al momento tipo user: #{user_aux.getRole}, provider:#{auth_hash['provider']}!"
    redirect_to root_url :notice=> "Signed in!!! with #{auth_hash['provider'] }"
  else
   begin
    user = UserOmniauth.new :name => auth_hash["info"]["name"], :email => auth_hash["info"]["email"], :uid =>auth_hash['info']['uid']
    log_in user
    params[:session][:remember_me] == '1' ? remember(user_aux) : forget(user_aux)
    redirect_back_or user_aux
   rescue
    flash[:success]="Ciao #{user.name}! sei stato registrato con successo ."
    redirect_to root_url :notice=> "Sign up succesful"
   ensure
    user.save