app/models/reservation.rb

class Reservation < ApplicationRecord
  before_save {self.position = room.reservations.count + 1 if self.position.nil?}
---
SELECT COUNT(*) FROM "reservations" WHERE "reservations"."room_id" = ? AND "reservations"."position" = ?  [["room_id", 1], ["position", 1]]