app/models/room.rb

INSERT INTO "powers" ("user_id", "room_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 3], ["room_id", 1], ["created_at", "2018-09-17 00:16:44.148436"], ["updated_at", "2018-09-17 00:16:44.148436"]]
SELECT  1 AS one FROM "powers" WHERE "powers"."room_id" = ? LIMIT ?  [["room_id", 1], ["LIMIT", 1]]
---
  before_save {adjust_time unless event_id }

  after_save{
    Power.create(room_id: id, user_id: self.user_id) if self.powers.empty?

UPDATE "rooms" SET "max_unjoin_time" = ?, "updated_at" = ? WHERE "rooms"."id" = ?  [["max_unjoin_time", "2018-09-18 09:00:00"], ["updated_at", "2018-09-17 00:16:45.785189"], ["id", 1]]
---
  def change_unjoin_time
    self.update(max_unjoin_time: Time.at((Time.parse(self.time_from.to_s) - 1.hour).to_i))

UPDATE "rooms" SET "event_id" = ?, "updated_at" = ? WHERE "rooms"."id" = ?  [["event_id", "f6ddai114424uglgii7d40u97g"], ["updated_at", "2018-09-17 00:16:45.763202"], ["id", 1]]
---
  def update_event
    event = Google::Apis::CalendarV3::Event.new({
      #NOME DESCRIZIONE E LOCATION DELL'EVENTO
      summary: self.name,
      description: self.description,
      location: self.address,

      #DATI DEL CREATORE, INIZIO EVENTO, FINE EVENTO
      organizer: {email: self.user.email, display_name: self.user.username},
      start:  Google::Apis::CalendarV3::EventDateTime.new(date_time: self.time_from.to_datetime.rfc3339),
      end:    Google::Apis::CalendarV3::EventDateTime.new(date_time: self.time_to.to_datetime.rfc3339),

      #RICCORRENZA VISIBILITÀ E PARTECIPANTI EVENTO
      #recurrence: self.recurrence,
      visibility: self.private ? 'private':'public',
    })
    cal = Inline::Application.config.cal
    #cal.authorization.update!(session[:authorization])
    if self.event_id.nil?

      event = cal.insert_event('primary', event)
      self.update(event_id: event.id)

    else

      event = cal.update_event('primary', self.event_id, event)

INSERT INTO "rooms" ("name", "description", "fifo", "max_participants", "address", "latitude", "longitude", "private", "time_from", "time_to", "user_id", "created_at", "updated_at", "hash_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def schedule
    if recurrence.empty?
      [self]
    else
      schedule = IceCube::Schedule.new(time_from)
      schedule.add_recurrence_rule(rule)
      start_date  = time_from.beginning_of_month.beginning_of_week
      end_date    = time_from + 60*60*24*30 #UN MESE DOPO (60 s * 60 m * 24 h * 30g)
      difference  = time_to - time_from
      schedule.occurrences(end_date).map do |date|
        #LE SETTIAMO PRIVATE PER NON INTASARE.
        logger.debug "DATAA #{date}"
        new_room = user.rooms.create!(name: name, time_from: date,
                            time_to: date + difference,
                            description: description,
                            address: address,
                            longitude: longitude,
                            latitude: latitude,
                            fifo: fifo, private: true,
                            max_participants: max_participants
                          )