app/models/user.rb

INSERT INTO "users" ("username", "email", "created_at", "updated_at", "activation_digest", "activated") VALUES (?, ?, ?, ?, ?, ?)
---
    def award(achievement)
        achievements << achievement.new